InformationRegisters/Лен_ЖурналИзменений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Лен_ЖурналИзменений</Name>
			<Comment>Хранение информации об изменениях значений реквизитов объектов ИБ</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Компьютер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеЗначения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Метаданные</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Реквизит</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Лен_ДействияРеквизитов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Лен_ДействияРеквизитов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Регистрируемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменяемый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Условие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяРеквизита</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяОбъектаМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/Лен_ЖурналИзменений/Ext/RecordSetModule.bsl
Перем мНабор, мВремяСобытия, мТекущийОбъект, мСсылкаВИБ, мМетаданное, мТипОбъектаМетаданных;

Процедура ПоказатьЗначениеМ(Знач Объект, ИмяСобытия, ИмяРеквизита) Экспорт
	
	ТипОбъекта = ТипЗнч(Объект);
	Если ТипОбъекта = Тип("ТаблицаЗначений") Тогда
		ФормаТаблицыЗначений = РегистрыСведений.Лен_ЖурналИзменений.ПолучитьФорму("ФормаТаблицы");
		ФормаТаблицыЗначений.ТаблицаЗначений = Объект.Скопировать();
		ФормаТаблицыЗначений.Заголовок = ФормаТаблицыЗначений.Заголовок + ": " + ИмяСобытия + " " + ИмяРеквизита;
		ФормаТаблицыЗначений.Открыть();
		Возврат;
	КонецЕсли;
	
	Попытка
		//Если Объект.ПолучитьОбъект() = Неопределено Тогда
		//	Возврат;
		//Иначе
			Объект.ПолучитьФорму().ОткрытьМодально();
		//КонецЕсли;
	Исключение
	КонецПопытки;
	
КонецПроцедуры

Функция ТипМетаданного(Объект)
	
	//Структура метаданных, по которым поддерживать регистрацию изменений
	СтруктураМетаданных = Новый Структура("Справочники, Документы", "Справочник", "Документ");
	
	Для каждого Метаданное из СтруктураМетаданных Цикл
		Если Метаданные[Метаданное.Ключ].Индекс(мМетаданное) > 0 Тогда
			Возврат Метаданное.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ("");
	
КонецФункции

Процедура ДобавитьЗапись(ИмяСобытия, ИмяРеквизита="", Значение="")
	
		
	Если мСсылкаВИБ.Пустая() Тогда
		//{+ нач ХохловСА 29.10.2021
		Если мТекущийОбъект.ОбменДанными.Загрузка = Ложь Тогда
			ТекущаяСсылкаВИБ = мТекущийОбъект.ПолучитьСсылкуНового();  //мТекущийОбъект.ссылка.уникальныйидентификатор()   УстановитьСсылкуНового();
		Иначе
			Возврат;
		КонецЕсли;
		//}- кон ХохловСА 29.10.2021		
	Иначе
		
		ТекущаяСсылкаВИБ = мСсылкаВИБ;
		                                                    
	КонецЕсли;	
	
	ДанныеСобытия = Добавить();
	
	ДанныеСобытия.Данные 				= ЗначениеВСтрокуВнутр(ТекущаяСсылкаВИБ);	
	ДанныеСобытия.Период                = мВремяСобытия;
	ДанныеСобытия.Событие               = ИмяСобытия;
	ДанныеСобытия.Метаданные            = мТипОбъектаМетаданных;
	ДанныеСобытия.Реквизит              = ИмяРеквизита;	
	
	ПредставлениеДанных  				= СтрЗаменить(Строка(ТекущаяСсылкаВИБ),"<Объект не найден> ","");	
	ДанныеСобытия.ПредставлениеДанных   = ПредставлениеДанных;
	
	ЗначениеРеквизита    				= ЗначениеВСтрокуВнутр(Значение);	
	ДанныеСобытия.ЗначениеРеквизита     = ЗначениеРеквизита;
	
	ПредставлениеЗначения 				= Строка(Значение);	
	ДанныеСобытия.ПредставлениеЗначения = ПредставлениеЗначения;	
	
	ДанныеСобытия.Пользователь          = ПараметрыСеанса.ТекущийПользователь;
	ДанныеСобытия.Компьютер             = ИмяКомпьютера();
	
КонецПроцедуры

Процедура ЗаписатьВЖурналИзменений(Знач ТекущийОбъект) Экспорт
	
	//Проверяем, нужно ли регистрировать изменения...
	//Если НЕ Константы.РегистрироватьИзменения.Получить() = Истина Тогда
	//	ТекущийОбъект = Неопределено;
	//	Возврат;                                
	//КонецЕсли; 
	
	//Если ПараметрыСеанса.НеРегистрироватьИзменения = Истина Тогда
	//	Возврат;                                
	//КонецЕсли;
		
	Если ТекущийОбъект.Ссылка.Пустая() 
		//{+ нач ХохловСА 29.10.2021
		и ТекущийОбъект.ПолучитьСсылкуНового().пустая() 
		//}- кон ХохловСА 29.10.2021		
		Тогда
		
		ИмяОбъектаМетаданных = ТекущийОбъект.Метаданные().Имя;      
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
			
			ТекущийОбъект.УстановитьСсылкуНового(Документы[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор));
			
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
			
			ТекущийОбъект.УстановитьСсылкуНового(Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор));
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		                                                    
	КонецЕсли;
	
	мВремяСобытия         = ТекущаяДата();
	мСсылкаВИБ 			  = ТекущийОбъект.Ссылка;
	мТекущийОбъект 		  = ТекущийОбъект;
	мМетаданное 		  = мТекущийОбъект.Метаданные();
	мТипОбъектаМетаданных = ТипМетаданного(мМетаданное) + " " + мМетаданное.Имя;
	
	Отбор.Период.Установить(мВремяСобытия);
	Отбор.Метаданные.Установить(мТипОбъектаМетаданных);
	
	//Получаем регистрируемые реквизиты объекта...
	Реквизиты = Новый Структура;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Рег.ИмяРеквизита,
	|	Рег.ИмяОбъектаМетаданных,
	|	Рег.ИмяТабличнойЧасти КАК ИмяТабличнойЧасти,
	|	Рег.ОбъектМетаданных
	|ИЗ
	|	РегистрСведений.Лен_ДействияРеквизитов КАК Рег
	|ГДЕ
	|	Рег.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных
	|	И Рег.Регистрируемый = ИСТИНА
	|	И Рег.ОбъектМетаданных = &ОбъектМетаданных
	|ИТОГИ ПО
	|	ИмяТабличнойЧасти";
					
	Если Метаданные.Документы.Содержит(ТекущийОбъект.Метаданные()) Тогда
		Запрос.УстановитьПараметр("ОбъектМетаданных"    ,"Документ");			
	ИначеЕсли Метаданные.Справочники.Содержит(ТекущийОбъект.Метаданные()) Тогда
		Запрос.УстановитьПараметр("ОбъектМетаданных"    ,"Справочник");						
	Иначе
		Запрос.УстановитьПараметр("ОбъектМетаданных"    ,"");		
	КонецЕсли;					
	
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных",мМетаданное.Имя);
	
	Выборка = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Если Выборка.Строки.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Для Каждого Корень Из Выборка.Строки Цикл
		
		Если ЗначениеЗаполнено(Корень.ИмяТабличнойЧасти) Тогда
			
			СтруктураТабличнойЧасти = Новый Структура;			
			
			Для Каждого Реквизит Из Корень.Строки Цикл
																
				СтруктураТабличнойЧасти.Вставить(Реквизит.ИмяРеквизита,1);					
				
			КонецЦикла;	
			
			Если СтруктураТабличнойЧасти.Количество() <> 0 Тогда
				Реквизиты.Вставить(Корень.ИмяТабличнойЧасти,СтруктураТабличнойЧасти);				
			КонецЕсли;
			
		Иначе
			
			Для Каждого Реквизит Из Корень.Строки Цикл				
				Реквизиты.Вставить(Реквизит.ИмяРеквизита,1);				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецЦикла;
			
	Для Каждого Реквизит Из Реквизиты Цикл
		
		Если ТипЗнч(Реквизит.Значение) = Тип("Число") Тогда
		//ОБЫЧНЫЙ РЕКВИЗИТ
			Попытка
				Если мСсылкаВИБ[Реквизит.Ключ] <> мТекущийОбъект[Реквизит.Ключ] Тогда
					ДобавитьЗапись("Изменение реквизита шапки", Реквизит.Ключ, мТекущийОбъект[Реквизит.Ключ]);
				КонецЕсли;
			Исключение
			
			КонецПопытки;
			
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Структура") Тогда
		//РЕКВИЗИТЫ ТАБЛИЧНОЙ ЧАСТИ
		
			Если Реквизит.Значение.Количество() = 0 Тогда
				Продолжить;
			КонецЕсли;
			
			ТабличнаяЧасть           = Неопределено;
			ТабличнаяЧастьВБазе      = Неопределено;
			ТабличнаяЧастьВДокументе = Неопределено;
			ТабличнаяЧастьВДокументе = мТекущийОбъект[Реквизит.Ключ].Выгрузить();
			
			Если мТекущийОбъект.Метаданные().Имя = "ЗаказНаряд" Тогда
				
				Если Реквизит.Ключ = "Товары" Тогда
					ИмяДокумента = "Товары";
				ИначеЕсли Реквизит.Ключ = "Взаиморасчеты" Тогда
					ИмяДокумента = "";
				Иначе
					ИмяДокумента = "Работы";
				КонецЕсли;
				
				Если ИмяДокумента <> "" Тогда
					
					ДокТЧ = Неопределено;
					ДокТЧ = Документы[ИмяДокумента].НайтиПоРеквизиту("ДокументОснование", мТекущийОбъект.Ссылка);
					
					Если Не ДокТЧ.Пустая() Тогда
						Попытка
							ТабличнаяЧастьВБазе = ДокТЧ[Реквизит.Ключ].Выгрузить();
						Исключение
							Продолжить;
						КонецПопытки;
					Иначе
						Продолжить;
					КонецЕсли; 
					
				Иначе  
					ТабличнаяЧастьВБазе = мСсылкаВИБ[Реквизит.Ключ].Выгрузить();
				КонецЕсли; 
				
			Иначе
				ТабличнаяЧастьВБазе = мСсылкаВИБ[Реквизит.Ключ].Выгрузить();
			КонецЕсли; 
			
			ОтборСтрок = Новый Структура;
			
			счСтрок = 0;
			
			Пока счСтрок <= ТабличнаяЧастьВБазе.Количество()-1 Цикл
				
				СтрокаТабличнаяЧастьВБазе = ТабличнаяЧастьВБазе.Получить(счСтрок);
				
				Для каждого РеквизитТаблицы Из Реквизит.Значение Цикл
					Попытка
						ОтборСтрок.Вставить(РеквизитТаблицы.Ключ, СтрокаТабличнаяЧастьВБазе[РеквизитТаблицы.Ключ]);
					Исключение
					КонецПопытки;
				КонецЦикла;
				
				Если ОтборСтрок.Количество() > 0 Тогда
					//Если в отборе есть реквизиты
					НайденныеСтроки = ТабличнаяЧастьВДокументе.НайтиСтроки(ОтборСтрок);
					
					Если НайденныеСтроки.Количество() > 0 Тогда
						//строка осталась нужно ее удалить
						ТабличнаяЧастьВБазе.Удалить(СтрокаТабличнаяЧастьВБазе);
						ТабличнаяЧастьВДокументе.Удалить(НайденныеСтроки[0]);
					Иначе
						//строка удалена в текущей таблице, но существовала ранее - оставляем ее
						счСтрок = счСтрок + 1;
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
			Если ТабличнаяЧастьВБазе.Количество() > 0 Тогда
				ДобавитьЗапись("Удалены строки из табличной части", Реквизит.Ключ, ТабличнаяЧастьВБазе);
			КонецЕсли;
			Если ТабличнаяЧастьВДокументе.Количество() > 0 Тогда
				ДобавитьЗапись("Добавлены строки в табличную часть", Реквизит.Ключ, ТабличнаяЧастьВДокументе);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	мСсылкаВИБ     = Неопределено;
	ТекущийОбъект  = Неопределено;
	мТекущийОбъект = Неопределено;
	
	Если Модифицированность() Тогда
		Попытка
			Записать();
		Исключение
			
		КонецПопытки;
	КонецЕсли;
		
КонецПроцедуры

Процедура ДобавитьЗаписьПечатныхФорм(Знач ТекущийОбъект, ИмяПечФормы) Экспорт
	
	//Проверям, нужно ли регистрировать изменения...
	Если НЕ Константы.РегистрироватьИзменения.Получить() Тогда
		ТекущийОбъект = Неопределено;
	    Возврат;                                
	КонецЕсли; 
		
	Если ТекущийОбъект.Ссылка.Пустая() Тогда
		
		ИмяОбъектаМетаданных = ТекущийОбъект.Метаданные().Имя;      
		
		Если Документы.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
			
			ТекущийОбъект.УстановитьСсылкуНового(Документы[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор));
			
		ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ТекущийОбъект.Ссылка)) Тогда
			
			ТекущийОбъект.УстановитьСсылкуНового(Справочники[ИмяОбъектаМетаданных].ПолучитьСсылку(Новый УникальныйИдентификатор));
			
		Иначе
			
			Возврат;
			
		КонецЕсли;
		                                                    
	КонецЕсли;
	
	мВремяСобытия         = ТекущаяДата();
	мСсылкаВИБ 			  = ТекущийОбъект.Ссылка;
	мТекущийОбъект 		  = ТекущийОбъект;
	мМетаданное 		  = мТекущийОбъект.Метаданные();
	мТипОбъектаМетаданных = ТипМетаданного(мМетаданное) + " " + мМетаданное.Имя;
	
	Отбор.Период.Установить(мВремяСобытия);
	Отбор.Метаданные.Установить(мТипОбъектаМетаданных);
		
	ДобавитьЗапись("Изменение реквизита шапки", "ИмяПечатнойФормы", ИмяПечФормы);	
	
	мСсылкаВИБ     = Неопределено;
	ТекущийОбъект  = Неопределено;
	мТекущийОбъект = Неопределено;
	
	Если Модифицированность() Тогда
		Попытка
			Записать();
		Исключение
			
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры
